x1 = int(input("Введите координаты точки x1 отрезка P1(x1,y1) = ")) # ввод
y1 = int(input("Введите координаты точки y1 отрезка P1(x1,y1) = ")) # ввод
x2 = int(input("Введите координаты точки x2 отрезка P2(x2,y2) = ")) # ввод
y2 = int(input("Введите координаты точки y2 отрезка P2(x2,y2) = ")) # ввод
x = int(input("Введите координаты x точки M(x,y) = ")) # ввод
y = int(input("Введите координаты y точки M(x,y) = ")) # ввод

if (x - x1) * (y2 - y1) - (y - y1) * (x2 - x1) == 0 \
        and x1 < x < x2 or x2 < x < x1: # Если векторы коллинеарны (равно нулю их векторное произведение)
    # и абсцисса точки P удовлетворяет условию 1 или условие 2 то
    print("Точка M (", x, ",", y, ")", "принадлежит отрезкам P1 и P2") # вывод
else: # иначе
    print("Точка M (", x, ",", y, ")", " НЕ принадлежит отрезкам P1 и P2") # вывод
